Catalogs/ТипыОбращенийПрочие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ТипыОбращенийПрочие</Name>
			<Comment>Типы обращений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритичностьОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АК_СрочностьОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнструкцияДляТехПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРолиИсполнителя</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РолиПолучателей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оповещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщения1С</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлПочта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СМС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТипыОбращенийПрочие/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//+++АК SHEP 20160514
&НаКлиенте
Процедура ЗаполнитьОповещения(Команда)
	
	Если Объект.Оповещения.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект.Оповещения.Добавить(), Новый Структура("РольИсполнителя, Сообщения1С, ЭлПочта", ПредопределенноеЗначение("Справочник.РолиИсполнителей.Инициатор")			, Истина, Ложь));
	ЗаполнитьЗначенияСвойств(Объект.Оповещения.Добавить(), Новый Структура("РольИсполнителя, Сообщения1С, ЭлПочта", ПредопределенноеЗначение("Справочник.РолиИсполнителей.Исполнитель")			, Истина, Ложь));
	ЗаполнитьЗначенияСвойств(Объект.Оповещения.Добавить(), Новый Структура("РольИсполнителя, Сообщения1С, ЭлПочта", ПредопределенноеЗначение("Справочник.РолиИсполнителей.ПомощникУправляющего"), Ложь	, Ложь));
	ЗаполнитьЗначенияСвойств(Объект.Оповещения.Добавить(), Новый Структура("РольИсполнителя, Сообщения1С, ЭлПочта", ПредопределенноеЗначение("Справочник.РолиИсполнителей.Управляющий")			, Ложь	, Ложь));	
	
КонецПроцедуры
//---АК SHEP 20160514
